In [1]:
# Import Pandas and Numpy
import numpy as np
import pandas as pd

In [15]:
my_index = ['India', 'China', 'USA', 'Canada'] # data list
my_data = [100,200,300,400] # Index list

In [16]:
# Make pandas Series from List - 1D
series1 = pd.Series(my_data, my_index)

In [20]:
my_dict = {'Canada': 40, 'USA': 30, 'China': 10, 'Hongkong': 50}

In [21]:
# Make pandas Series from Dict
series2 = pd.Series(my_dict)

In [22]:
# Make pandas Series arithmatic
series1 - series2

Canada      360.0
China       190.0
Hongkong      NaN
India         NaN
USA         270.0
dtype: float64

In [24]:
series1 + series2

Canada      440.0
China       210.0
Hongkong      NaN
India         NaN
USA         330.0
dtype: float64

In [25]:
series1 * series2

Canada      16000.0
China        2000.0
Hongkong        NaN
India           NaN
USA          9000.0
dtype: float64

In [26]:
# access data from Dataframe
series1['Canada']

400

In [29]:
#Create a random dataframe
df = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.395259 -0.688311  1.352756 -1.867201
B -1.605597 -1.064842 -0.750810 -1.997104
C -1.246986 -0.635285 -1.381550  0.330839
D  0.622141  1.105034 -0.905798  0.145563
E -0.113077  1.003500 -0.464924 -0.014053

In [34]:
df = {
    'Name': pd.Series(['John', 'Steve', 'Sylvia'], index=['a', 'b', 'c']),
     'Age': pd.Series(['23','45','67','33'], index= ['a','b','c','d']),
     'Nationality': pd.Series(['USA','Canada'], index=['c','d'])
     }
my_df = pd.DataFrame(df)
my_df

     Name Age Nationality
a    John  23         NaN
b   Steve  45         NaN
c  Sylvia  67         USA
d     NaN  33      Canada

In [43]:
data = {
    'Name': ['Sonal', 'Shivani', 'Varsha'],
    'Age': [22, 34, 56],
    'Nationality': ['India', 'USA', 'Canada']
}
my_df = pd.DataFrame(data, index=['a', 'b', 'c'])
my_df

      Name  Age Nationality
a    Sonal   22       India
b  Shivani   34         USA
c   Varsha   56      Canada

In [44]:
my_df['Name']

a      Sonal
b    Shivani
c     Varsha
Name: Name, dtype: object

In [45]:
type(my_df['Name'])

pandas.core.series.Series

In [46]:
# access multiple columns from dataframe
my_df[['Name', 'Age']]

      Name  Age
a    Sonal   22
b  Shivani   34
c   Varsha   56

In [49]:
# Add new column in existing dataframe
my_df['Ethnicity'] = pd.Series(['India', 'America'], index=['a','b'])

In [50]:
my_df

      Name  Age Nationality Ethnicity
a    Sonal   22       India     India
b  Shivani   34         USA   America
c   Varsha   56      Canada       NaN

In [51]:
my_df['NatEth'] = my_df['Nationality'] + my_df['Ethnicity']
my_df

      Name  Age Nationality Ethnicity      NatEth
a    Sonal   22       India     India  IndiaIndia
b  Shivani   34         USA   America  USAAmerica
c   Varsha   56      Canada       NaN         NaN

In [53]:
#delete column (axis = 1) - note: this is not permanent delete unless we add "inplace=1"
my_df.drop('NatEth', axis=1)

      Name  Age Nationality Ethnicity
a    Sonal   22       India     India
b  Shivani   34         USA   America
c   Varsha   56      Canada       NaN

In [54]:
#delete row (axis = 0) - note: this is not permanent delete unless we add "inplace=1"
my_df.drop('c', axis=0)

      Name  Age Nationality Ethnicity      NatEth
a    Sonal   22       India     India  IndiaIndia
b  Shivani   34         USA   America  USAAmerica

In [55]:
my_df

      Name  Age Nationality Ethnicity      NatEth
a    Sonal   22       India     India  IndiaIndia
b  Shivani   34         USA   America  USAAmerica
c   Varsha   56      Canada       NaN         NaN

In [56]:
# permanent delete from dataframe
my_df.drop('NatEth', axis=1, inplace=True)

In [57]:
my_df

      Name  Age Nationality Ethnicity
a    Sonal   22       India     India
b  Shivani   34         USA   America
c   Varsha   56      Canada       NaN

In [60]:
# access row by location (loc)
my_df.loc['a']

Name           Sonal
Age               22
Nationality    India
Ethnicity      India
Name: a, dtype: object

In [61]:
# access row by index location (iloc)
my_df.iloc[0]

Name           Sonal
Age               22
Nationality    India
Ethnicity      India
Name: a, dtype: object

In [62]:
my_df.iloc[1]

Name           Shivani
Age                 34
Nationality        USA
Ethnicity      America
Name: b, dtype: object

In [63]:
# access multiple rows by index locations
my_df.iloc[[0,1]]

      Name  Age Nationality Ethnicity
a    Sonal   22       India     India
b  Shivani   34         USA   America

In [64]:
# access by row and column
my_df.loc['b','Name']

'Shivani'

In [66]:
# access multiple elements by rows and columns
my_df.loc[['b','c'],['Name','Age']]

      Name  Age
b  Shivani   34
c   Varsha   56

In [67]:
my_df

      Name  Age Nationality Ethnicity
a    Sonal   22       India     India
b  Shivani   34         USA   America
c   Varsha   56      Canada       NaN

In [68]:
# access data conditionally
my_df[my_df['Age']>50]

     Name  Age Nationality Ethnicity
c  Varsha   56      Canada       NaN

In [69]:
# only required column satifying given condition
my_df[my_df['Age']>50]['Name']

c    Varsha
Name: Name, dtype: object

In [72]:
# multiple columns satifying given condition
my_df[my_df['Age']>30][['Name','Nationality']]

      Name Nationality
b  Shivani         USA
c   Varsha      Canada

In [75]:
# multiple conditions on dataframe
my_df[(my_df['Age']>20) & (my_df['Age']<40)]

      Name  Age Nationality Ethnicity
a    Sonal   22       India     India
b  Shivani   34         USA   America

In [76]:
# resets index of dataframe to default pandas indexes
my_df.reset_index()

  index     Name  Age Nationality Ethnicity
0     a    Sonal   22       India     India
1     b  Shivani   34         USA   America
2     c   Varsha   56      Canada       NaN

In [78]:
# Add new column
my_df["ID"] = ['id1', 'id2', 'id3']

In [79]:
my_df

      Name  Age Nationality Ethnicity   ID
a    Sonal   22       India     India  id1
b  Shivani   34         USA   America  id2
c   Varsha   56      Canada       NaN  id3

In [80]:
# set newly added column as index
my_df.set_index('ID')

        Name  Age Nationality Ethnicity
ID
id1    Sonal   22       India     India
id2  Shivani   34         USA   America
id3   Varsha   56      Canada       NaN

In [88]:
# Adding multiple indexes
outside = ['0 level', '0 level', '0 level', '1 level', '1 level', '1 level']
inside = [21,22,23,21,22,23]
my_index = list(zip(outside,inside))
my_index = pd.MultiIndex.from_tuples(my_index)
my_index

MultiIndex(levels=[['0 level', '1 level'], [21, 22, 23]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [89]:
# assign the multiple indexes to dataframe
df = pd.DataFrame(np.random.randn(6,2), index=my_index)
df

                   0         1
0 level 21 -0.139380  1.558531
        22 -0.611315  0.597272
        23  0.872937 -0.410538
1 level 21 -1.356918 -1.027238
        22 -0.234563 -0.650120
        23 -0.485997 -1.052466

In [92]:
df.loc['0 level']

           0         1
21 -0.139380  1.558531
22 -0.611315  0.597272
23  0.872937 -0.410538

In [93]:
df.loc['0 level'].loc[21]

0   -0.139380
1    1.558531
Name: 21, dtype: float64

In [94]:
df

                   0         1
0 level 21 -0.139380  1.558531
        22 -0.611315  0.597272
        23  0.872937 -0.410538
1 level 21 -1.356918 -1.027238
        22 -0.234563 -0.650120
        23 -0.485997 -1.052466

In [98]:
# assign column names to indexes
df.index.names = ['catergory', 'nums']

In [99]:
df

                       0         1
catergory nums
0 level   21   -0.139380  1.558531
          22   -0.611315  0.597272
          23    0.872937 -0.410538
1 level   21   -1.356918 -1.027238
          22   -0.234563 -0.650120
          23   -0.485997 -1.052466

In [100]:
# fetch cross-section - as below: nums = 22
df.xs(22, level='nums')

                  0         1
catergory
0 level   -0.611315  0.597272
1 level   -0.234563 -0.650120

In [102]:
df = pd.DataFrame({'A': ('2','3','4'), 'B': (np.nan, np.nan, 34), 'C':(21,'GF',np.nan)})
df

   A     B    C
0  2   NaN   21
1  3   NaN   GF
2  4  34.0  NaN

In [103]:
# drop rows and columns which have NaN values
df.dropna()

Empty DataFrame
Columns: [A, B, C]
Index: []

In [104]:
# drop the columns which have NaN values
df.dropna(axis=1)

   A
0  2
1  3
2  4

In [105]:
df

   A     B    C
0  2   NaN   21
1  3   NaN   GF
2  4  34.0  NaN

In [106]:
# Fill all NaN with 10
df.fillna(10)

   A     B   C
0  2  10.0  21
1  3  10.0  GF
2  4  34.0  10

In [107]:
# Fill NaN in column A with mean of values in A
df['A'].fillna(df['A'].mean())

0    2
1    3
2    4
Name: A, dtype: object

In [108]:
# no changes, as A column does not have any NaN values
df

   A     B    C
0  2   NaN   21
1  3   NaN   GF
2  4  34.0  NaN

In [109]:
# Fill NaN in column B with mean of values in B - not a permanent replacement unless "inplace = 1"
df['B'].fillna(df['B'].mean())

0    34.0
1    34.0
2    34.0
Name: B, dtype: float64

In [110]:
df

   A     B    C
0  2   NaN   21
1  3   NaN   GF
2  4  34.0  NaN

In [111]:
data = {
    'Company': ('Google','Google','Apple','Apple','Amazon','Amazon'),
    'Person': ('Sam', 'Dam','Charlie', 'Saim', 'Poil','PJK'),
    'Salary': (120,232,129,90,40,80)
}
df = pd.DataFrame(data)
df

  Company   Person  Salary
0  Google      Sam     120
1  Google      Dam     232
2   Apple  Charlie     129
3   Apple     Saim      90
4  Amazon     Poil      40
5  Amazon      PJK      80

In [112]:
# data group by Company and find mean of numeric column
df.groupby('Company').mean()

         Salary
Company
Amazon     60.0
Apple     109.5
Google    176.0

In [113]:
df.groupby('Company').count()

         Person  Salary
Company
Amazon        2       2
Apple         2       2
Google        2       2

In [114]:
# get basic stats for numeric columns in dataframe
df.describe()

           Salary
count    6.000000
mean   115.166667
std     65.398522
min     40.000000
25%     82.500000
50%    105.000000
75%    126.750000
max    232.000000

In [115]:
# company specific stats
df.groupby('Company').describe()

        Salary
         count   mean        std    min     25%    50%     75%    max
Company
Amazon     2.0   60.0  28.284271   40.0   50.00   60.0   70.00   80.0
Apple      2.0  109.5  27.577164   90.0   99.75  109.5  119.25  129.0
Google     2.0  176.0  79.195959  120.0  148.00  176.0  204.00  232.0

In [116]:
# vertical layout for describe
df.groupby('Company').describe().transpose()

Company          Amazon       Apple      Google
Salary count   2.000000    2.000000    2.000000
       mean   60.000000  109.500000  176.000000
       std    28.284271   27.577164   79.195959
       min    40.000000   90.000000  120.000000
       25%    50.000000   99.750000  148.000000
       50%    60.000000  109.500000  176.000000
       75%    70.000000  119.250000  204.000000
       max    80.000000  129.000000  232.000000

In [117]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
# concat all dataframes
df=pd.concat([df1,df2,df3])
df

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [167]:
left = pd.DataFrame({'key':(1,2,4), 'A':('a1','a2','a3'), 'B':('b1','b2','b3')})
right = pd.DataFrame({'key':(1,2,5), 'C':('c1','c2','c3'), 'D':('d1','d2','d3')})
# merge the data - SQL style
pd.merge(left,right,how='outer',on='key')

   key    A    B    C    D
0    1   a1   b1   c1   d1
1    2   a2   b2   c2   d2
2    4   a3   b3  NaN  NaN
3    5  NaN  NaN   c3   d3

In [168]:
left = pd.DataFrame({'A':('a1','a2','a3'), 'B':('b1','b2','b3')},index=(1,2,4))
right = pd.DataFrame({'C':('c1','c2','c3'), 'D':('d1','d2','d3')},index=(1,2,5))
# SQL style join
left.join(right)

    A   B    C    D
1  a1  b1   c1   d1
2  a2  b2   c2   d2
4  a3  b3  NaN  NaN

In [127]:
left.join(right,how='outer')

     A    B    C    D
1   a1   b1   c1   d1
2   a2   b2   c2   d2
4   a3   b3  NaN  NaN
5  NaN  NaN   c3   d3

In [139]:
df = pd.DataFrame({'A':(1,2,3,1),'B':('b2','b2','b3','b3'),'C':('c1','c2','c5','c5')})
df

   A   B   C
0  1  b2  c1
1  2  b2  c2
2  3  b3  c5
3  1  b3  c5

In [140]:
# get unique values from B column
df['B'].unique()

array(['b2', 'b3'], dtype=object)

In [141]:
# number of unique entries in A column
df['A'].nunique()

3

In [142]:
# categorical counts
df['A'].value_counts()

1    2
3    1
2    1
Name: A, dtype: int64

In [143]:
# apply function to column
def square(n):
    return n*n

df['A'].apply(square)

0    1
1    4
2    9
3    1
Name: A, dtype: int64

In [144]:
# apply built-in function
df['C'].apply(len)

0    2
1    2
2    2
3    2
Name: C, dtype: int64

In [146]:
df['A'].apply(lambda x: x**2)

0    1
1    4
2    9
3    1
Name: A, dtype: int64

In [147]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [148]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [171]:
df = pd.DataFrame({'A':(1,2,3,1),'B':('b2','b2','b3','b3'),'C':('c1','c2','c5','c5')})
df.sort_values('A')

   A   B   C
0  1  b2  c1
3  1  b3  c5
1  2  b2  c2
2  3  b3  c5

In [172]:
df.sort_values('C', ascending=False)

   A   B   C
2  3  b3  c5
3  1  b3  c5
1  2  b2  c2
0  1  b2  c1

In [153]:
df.isnull()

       A      B      C
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [155]:
data = {
    'A':('dog','dog','dog','cat','cat','cat'),
    'B':('brown','brown','black','black','white','white'),
    'C':('x','y','x','y','x','y'),
    'D':(1,2,3,5,4,1)
}
df = pd.DataFrame(data)
# spreadsheet style pivot table
pd.pivot_table(df,values='D',index=['A','B'],columns=['C'])

C            x    y
A   B
cat black  NaN  5.0
    white  4.0  1.0
dog black  3.0  NaN
    brown  1.0  2.0

In [156]:
# write dataframe df to CSV
df.to_csv('New_DataFrame',index=False)

In [157]:
# read CSV named 'New_DataFrame'
pd.read_csv('New_DataFrame')

     A      B  C  D
0  dog  brown  x  1
1  dog  brown  y  2
2  dog  black  x  3
3  cat  black  y  5
4  cat  white  x  4
5  cat  white  y  1

In [173]:
# read 2nd table (0 being 1st and 1 being 2nd) from HTML
df = pd.read_html('https://en.wikipedia.org/wiki/List_of_banks_in_the_United_Kingdom')
df[1]

,Name of Bank,Parent Company,Location of Headquarters (for Parent where applicable)
0,Abbey National Treasury Services Plc,The Santander Group,Spain
1,ABC International Bank Plc,Arab Banking Corporation,Bahrain
2,"Access Bank UK Limited, The",Access Bank Group,Nigeria
3,Adam & Company Plc,The Royal Bank of Scotland Group,Scotland
4,ADIB (UK) Ltd,Abu Dhabi Islamic Bank,United Arab Emirates
5,Ahli United Bank (UK) PLC,Ahli United Bank,Bahrain
6,AIB Group (UK) Plc,Allied Irish Banks,Republic of Ireland
7,Al Rayan Bank PLC,Masraf Al Rayan,Qatar
8,Aldermore Bank Plc,Independently run,England
9,Alliance Trust Savings Limited,Alliance Trust,Scotland
10,Alpha Bank London Limited,Alpha Bank,Greece
11,ANZ Bank (Europe) Limited,Australia and New Zealand Banking Group,Australia
12,Arbuthnot Latham & Co Limited,Arbuthnot Banking Group,England
13,Atom Bank PLC,Independently run,England
14,Axis Bank UK Limited,Axis Bank,India
15,Bank and Clients PLC,Ocean Industries S.A.,Luxembourg
16,Bank Leumi (UK) plc,Bank Leumi,Israel
17,Bank Mandiri (Europe) Limited,Bank Mandiri,Indonesia
18,Bank of America Merrill Lynch International Li...,Bank of America,United States of America
19,Bank of Baroda,Government of India,India
20,Bank of Beirut (UK) Ltd,Bank of Beirut,Lebanon
21,Bank of Ceylon (UK) Ltd,Bank of Ceylon,Sri Lanka
22,Bank of China (UK) Ltd,Bank of China,China
23,Bank of Communications (UK) Limited,Bank of Communications,China
24,Bank of Cyprus UK Limited,Bank of Cyprus,Cyprus
25,Bank of India,Government of India,India
26,Bank of Ireland (UK) Plc,Bank of Ireland,Republic of Ireland
27,Bank of London and The Middle East plc,Independently run,England
28,Bank of New York Mellon (International) Limite...,The Bank of New York Mellon,United States of America
29,Bank of Scotland plc,Lloyds Banking Group,England
...,...,...,...
124,Scotiabank Europe Plc,Scotiabank,Canada
125,Scottish Widows Bank Plc,Lloyds Banking Group,Scotland
126,Secure Trust Bank Plc,Independently run,England
127,Shawbrook Bank Limited,Independently run,England
128,Smith & Williamson Investment Services Limited,Independently run,England
129,Sonali Bank (UK) Limited,51% of the shares are held by Bangladesh Gover...,Bangladesh
130,Standard Chartered Bank,Independently run,England
131,Starling Bank Limited,Independently run,England
132,State Bank of India,State Bank of India Group,India
133,Sumitomo Mitsui Banking Corporation Europe Lim...,Sumitomo Mitsui Financial Group,Japan
134,Tandem Bank Limited,Tandem Money Limited,England
135,TD Bank Europe Limited,Toronto-Dominion Bank,Canada
136,Tesco Personal Finance Plc,Independently run,England
137,TSB Bank plc,Banco Sabadell,Spain
138,Turkish Bank (UK) Ltd,The Turkish Bank Group,Turkey
139,UBS Limited,UBS,Switzerland
140,Ulster Bank Ltd,Royal Bank of Scotland Group,Scotland
141,Union Bank of India (UK) Limited,Union Bank of India,India
142,Union Bank UK Plc,Union Bank of Nigeria,Nigeria
143,United National Bank Limited,United Bank (Pakistan),Pakistan
144,United Trust Bank Limited,Independently run,England
145,Unity Trust Bank Plc,Independently run,England
146,Vanquis Bank Limited,Provident Financial,England
147,Virgin Money plc,CYBG PLC,England
148,VTB Capital plc,VTB Bank,Russia
149,Weatherbys Bank Limited,Weatherbys,England
150,Wesleyan Bank Limited,Wesleyan Assurance Society,England
151,Westpac Europe Ltd,Westpac,Australia
152,Wyelands Bank Plc,GFG Alliance,England
153,Zenith Bank (UK) Limited,Zenith Bank,Nigeria

In [162]:
# from codecademy tutorials
data = [[11,'sonal'], [12,'Sania'], [13,'Shivani'], [14,'Suraj']]
df = pd.DataFrame(data)
df

    0        1
0  11    sonal
1  12    Sania
2  13  Shivani
3  14    Suraj

In [163]:
df.dtypes

0     int64
1    object
dtype: object

In [164]:
type(df)

pandas.core.frame.DataFrame

In [166]:
# df from dict
data = {'a': ['A', 'ABC'], 'b': ['B','BCD']}
pd.DataFrame(data, index=['jar','cat'])

       a    b
jar    A    B
cat  ABC  BCD